ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГосЗаказ</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеТребования</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="15fca05d-7959-4a2b-9062-e424f3982539">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6df6fc76-a3cd-4de0-a023-25f5c09faf10">
    <name>НачатьНеРанее</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91b5bd8a-a202-4ee3-a07e-d2244bd4d2bb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8b15-f8e1-48f5-a895-0a0068c7711a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25c088f7-7f66-4e72-9549-39343550e4b5">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff56eabe-a6d5-4725-a7e1-6d3c1cffefbc">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="191fc3ee-3065-4648-ad89-72b3cbf6a108">
    <name>ДатаПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88a5e505-c602-47c9-9dd8-4b109bf0874f">
    <name>ДинамическаяСтруктура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb924568-6ab5-4bc3-9ed4-53888e5a2470">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a32405d7-b213-4b91-8842-bc3b27c23a17">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a6e457f-9de3-483b-9f11-8235c0db3365">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce2f7918-6eb6-44a1-9703-eaa30ed728d8">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fb6ec89-8b54-4467-a7ee-20b1f54a8233">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Enums/СтатусыЗаказовНаПроизводство2_2/СтатусыЗаказовНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="555d6846-e773-489b-bd3c-89b1f2072899">
  <name>СтатусыЗаказовНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f552acdf-34c7-46f3-8d72-fc207a70ea04">
    <name>Формируется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктуализацияСпецификаций</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСпецтребований</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues extendedConfigurationObject="c3e0c47c-9d7b-4349-82a5-35dfcec47e59">
    <name>КПроизводству</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСклад</name>
  </enumValues>
  <enumValues extendedConfigurationObject="7cac9ffb-82fe-4e2c-8db3-94162621dc09">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке</registerRecords>
  <registerRecords>AccumulationRegister.cbr_ОстаткиНоменклатурыПоСоглашению</registerRecords>
  <attributes>
    <name>cbr_Проект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТранспортныйТариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтоимостьДоставкиСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтоимостьДоставки</name>
    <comment>//++ БаженоваЕО 22.01.2026 ПР17</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтоимостьДоставкиБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДокументыДляВодителя</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТаможенноеСопровождение</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_УсловияДоставки</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованияКУпаковке</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованияКЭтикетке</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованиеККомплектации</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_НеБолееДатыПроизводства</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДопустимыйОстатокГСХНеМенееПроцент</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДопустимыйОстатокГСХНеМенееМес</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПрочиеТребования</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПересечениеМенеджеров</name>
    <comment>//++ БаженоваЕО 27.01.2026 ПРД.18</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_АгентскоеВознаграждение</name>
    <comment>//++ Тусеев ПРД12</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="3c728d38-3039-41f6-b288-2b92f32630c3">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8d06692-73f7-469f-a6a7-388a13d421d2">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>cbr_МаксимальнаяРучнаяСкидка</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПроцентТУ</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_МаксимальнаяРучная</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПроцентАВ</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_МожноРедактироватьТранспортныеУсловия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>cbr_ТЧПересечениеМенеджеров</name>
    <comment>//++ БаженоваЕО 27.01.2026 ПРД.18</comment>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7b526229-3286-418a-920a-ff15a9b3ec48">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>cbr_ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>cbr_СтрокаИзСоглашенияСКлиентом</name>
      <comment>//AlopinAS ПРД20</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>cbr_Актуальность</name>
      <comment>// Мохов 20.02.2026 ПРЗ.30</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <comment>// Мохов 20.02.2026 ПРЗ.30</comment>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>cbr_ЭтоПФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>cbr_АгентскиеВознаграждения</name>
    <comment>//++ Тусеев ПРД12</comment>
    <attributes>
      <name>Агент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорАгента</name>
      <type>
        <types>DocumentRef.ВерсияСоглашенияКоммерческийДоговор</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказНаПроизводство2_2/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура П3_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// НАЧАЛО Османов Н.М. 21.03.2025 
	ОрганизацияТПС = Константы.ОрганизацияТПС.ЗначениеЭтойКонстанты();

	Если Не Организация = ОрганизацияТПС Тогда
		ТекстСообщения = НСтр("ru='Организация для этого документа должна быть: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОрганизацияТПС);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	// КОНЕЦ Османов Н.М. 21.03.2025 
	
	//++ Мохов ПРЗ.17 27.02.2026	
	Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда
		ЕстьСпецификации = Ложь;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);		
		Запрос.Текст = "ВЫБРАТЬ
		|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация КАК РесурснаяСпецификация
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.cbr_РесурсныеСпецификации КАК СоглашенияСКлиентамиcbr_РесурсныеСпецификации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО (ЗаказКлиента.Соглашение = СоглашенияСКлиентамиcbr_РесурсныеСпецификации.Ссылка)
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка";		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ЕстьСпецификации = Истина;	
		КонецЕсли;			
		ТоварыЗаказКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Товары").Выгрузить();	
		Если ЕстьСпецификации Тогда
			Если НЕ ТоварыЗаказКлиента.Найти(Ложь,"cbr_ЭтоПФ") = Неопределено Тогда
				Отказ = Истина;
				СообщениеОбОшибке = Нстр("ru='Обнаружено несоответствие номенклатуры соглашения и номенклатуры в таблице Товары!
				|Запись Заказа на произовдство отменена!'");
				ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
				СобытиеЖурналаРегистрации = "ЗаказНаПроизводство2_2.ПередЗаписью";
				ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);										
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;		
	//-- Мохов ПРЗ.17 
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПоЗаказуКлиента")
Процедура П3_ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения)

	ЗаказКлиента = ДанныеЗаполнения.Основание;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаказКлиента.Приоритет          КАК Приоритет,
	|	ЗаказКлиента.Организация        КАК Организация,
	|	ЗаказКлиента.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВЫБОР 
	|		КОГДА ЗаказКлиента.НаправлениеДеятельности.УчетЗатрат
	|			ТОГДА ЗаказКлиента.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента");

	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);

	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();

	// Заполнение шапки
	Организация             = Реквизиты.Организация;
	ДокументОснование       = ЗаказКлиента;
	ЗаказПодДеятельность    = Реквизиты.НалогообложениеНДС;
	Приоритет               = Реквизиты.Приоритет;
	НаправлениеДеятельности = Реквизиты.НаправлениеДеятельности;

	// Заполнение табличной части
	ЗаполнитьПоТаблицеТоварыИзХранилища(ДанныеЗаполнения.АдресТовары, "ДатаОтгрузки");
	
	#Вставка // НАЧАЛО Алейников М.Н. 24.03.2025 Б121
	Если Не Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству") Тогда
		СпецификацииЗаполнены = Истина;
		Для Каждого СтрокаПродукции Из Продукция Цикл
			Если Не ЗначениеЗаполнено(СтрокаПродукции.Спецификация) Тогда
				СпецификацииЗаполнены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СпецификацииЗаполнены Тогда
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству"); 
		Иначе
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2.АктуализацияСпецификаций"); 
		КонецЕсли;
	КонецЕсли;
	#КонецВставки // КОНЕЦ Алейников М.Н. 24.03.2025 Б121
	
	#Вставка // НАЧАЛО Алейников М.Н. 24.03.2025 Б121
	СвойствоУпаковка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "УпаковкаРеквизитХарактеристики");
	МассивСвойств = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СвойствоУпаковка);
	
	Для Каждого СтрокаПродукции Из Продукция Цикл
		ТаблицаСвойствХарактеристик = УправлениеСвойствами.ЗначенияСвойств(СтрокаПродукции.Характеристика, Истина, , МассивСвойств);
		
		Если ТаблицаСвойствХарактеристик.Количество() Тогда
			ЗначениеСвойстваХарактеристика = ТаблицаСвойствХарактеристик[0].Значение;
			Если Не СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика Тогда
				КоэффициентУпаковки= Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки
				(ЗначениеСвойстваХарактеристика, СтрокаПродукции.Номенклатура);
				СтрокаПродукции.КоличествоУпаковок = СтрокаПродукции.КоличествоУпаковок / КоэффициентУпаковки;
				СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;
	#КонецВставки // КОНЕЦ Алейников М.Н. 24.03.2025 Б121

КонецПроцедуры


&ИзменениеИКонтроль("ЗаполнитьПоТаблицеТовары")
Процедура cbr_ЗаполнитьПоТаблицеТовары(ТаблицаТоваров)

	Если ТаблицаТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЕстьСпецификация = ТаблицаТоваров.Колонки.Найти("Спецификация") <> Неопределено;

	ЕстьНачатьНеРанее = ТаблицаТоваров.Колонки.Найти("НачатьНеРанее") <> Неопределено;
	Если ЕстьНачатьНеРанее Тогда
		НачатьНеРанее = ТаблицаТоваров[0].НачатьНеРанее;
	КонецЕсли;

	ДоступноНесколькоДатПотребности = ДинамическаяСтруктура;
	НесколькоДатПотребности = Ложь;

	ЕстьДатаПотребности = ТаблицаТоваров.Колонки.Найти("ДатаПотребности") <> Неопределено;
	Если ЕстьДатаПотребности Тогда
		ДатаПотребности = ТаблицаТоваров[0].ДатаПотребности;
	КонецЕсли;

	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураДействий = Новый Структура;

	Если ТаблицаТоваров.Колонки.Найти("КоличествоУпаковок") = Неопределено Тогда
		СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	конецЕсли;
	
	#Вставка
	//++ Мохов ПРЗ.17
	ВывестиСообщение = Ложь;
	Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда
		ВыгрузкаЗапросТоварыЗаказКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Товары").Выгрузить();	
	КонецЕсли;
	//-- Мохов ПРЗ.17
	#КонецВставки
		
	ОбрабатываемыеСтроки = Новый Массив;
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл

		#Вставка
		//++ Мохов ПРЗ.17
		Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда 
			СтрокаПоискаИзОснования = ВыгрузкаЗапросТоварыЗаказКлиента.Найти(СтрокаТовара.Номенклатура,"Номенклатура");
			Если НЕ СтрокаПоискаИзОснования.cbr_Актуальность Тогда
				ВывестиСообщение = Истина;
				Продолжить;	
			КонецЕсли;
		КонецЕсли;	
		//-- Мохов ПРЗ.17
		#КонецВставки

		СтрокаПродукция = Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПродукция, СтрокаТовара);

		Если ЕстьНачатьНеРанее Тогда
			НачатьНеРанее = Мин(НачатьНеРанее, СтрокаТовара.НачатьНеРанее);
		КонецЕсли;

		Если ЕстьДатаПотребности Тогда

			Если ДатаПотребности <> СтрокаТовара.ДатаПотребности И Не НесколькоДатПотребности Тогда
				НесколькоДатПотребности = Истина;
			КонецЕсли;

			ДатаПотребности = Мин(ДатаПотребности, СтрокаТовара.ДатаПотребности);

		КонецЕсли;

		ОбрабатываемыеСтроки.Добавить(СтрокаПродукция);

	КонецЦикла;

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Продукция,
		КэшированныеЗначения);

	Если ЗначениеЗаполнено(ДатаПотребности) Тогда
		РазмещениеВыпуска = Перечисления.СпособыПривязкиОперацийПроизводства.КОкончанию;
	КонецЕсли;
	Если НесколькоДатПотребности Тогда
		Если Не ДоступноНесколькоДатПотребности Тогда
			ПроизводствоСервер.ЗаполнитьРеквизитВКоллекции(Продукция, "ДатаПотребности", ДатаПотребности);
		Иначе
			ДатаПотребностиУказываетсяВСтроках = Истина;
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьДанныеСпецификацииВСтроках();

	// если вместе с товарами передается спецификация, нужно исключить возможные конфликты
	Если ЕстьСпецификация И ДинамическаяСтруктура Тогда
		ИсключитьДублированиеСпецификацийВТабличнойЧасти(Продукция);
	КонецЕсли;

	#Вставка
	//++ Мохов ПРЗ.17
	Если ВывестиСообщение Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Из заказа клиента были перенесены не все ресурсные спецификации!
		|Были созданы задачи по их актуализации!'"));		
	КонецЕсли;
	//-- Мохов ПРЗ.17
	#КонецВставки

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ЗаполнитьДанныеСпецификацииВСтроках")
Процедура cbr_ЗаполнитьДанныеСпецификацииВСтроках(ТолькоНезаполненные)

	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделиях.ПараметрыВыбораСпецификаций(ЭтотОбъект, Документы.ЗаказНаПроизводство2_2);

	// Заполнение спецификаций
	МассивДанных = Новый Массив;
	МассивСтрок = Новый Массив;
	
	#Вставка
	//++ Мохов 20.02.2026 ПРЗ.17
	Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда
		ВыгрузкаЗапросТоварыЗаказКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Товары").Выгрузить();	
	КонецЕсли;	
	//-- Мохов 20.02.2026 ПРЗ.17
	#КонецВставки
	
	Для каждого Строка Из Продукция Цикл

		Если ТолькоНезаполненные И Не Строка.Спецификация.Пустая() Тогда
			Продолжить;
		КонецЕсли;

		ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СобратьДанныеОбИзделииДляВыбораСпецификации(
			ЭтотОбъект, Строка, ПараметрыВыбораСпецификаций);

		МассивДанных.Добавить(ДанныеОбИзделии);
		МассивСтрок.Добавить(Строка);
		
		#Вставка
		//++ Мохов 20.02.2026 ПРЗ.17
		Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда
			СтрокаИзЗапроса = ВыгрузкаЗапросТоварыЗаказКлиента.Найти(Строка.Номенклатура,"Номенклатура");
			Если НЕ СтрокаИзЗапроса = Неопределено	Тогда
				Если СтрокаИзЗапроса.cbr_Актуальность Тогда
					Строка.Спецификация = СтрокаИзЗапроса.Спецификация;
				КонецЕсли;																
			КонецЕсли;	
		КонецЕсли;
		//-- Мохов 20.02.2026 ПРЗ.17
		#КонецВставки
		
	КонецЦикла;

	#Удаление
	// Заполним спецификации
	УправлениеДаннымиОбИзделиях.ЗаполнитьСпецификациюВСтроках(МассивСтрок, МассивДанных, ПараметрыВыбораСпецификаций);
	#КонецУдаления
	
	#Вставка
	//++ Мохов 20.02.2026 ПРЗ.17	
	УправлениеДаннымиОбИзделиях.ЗаполнитьСпецификациюВСтроках(МассивСтрок, МассивДанных, ПараметрыВыбораСпецификаций,, ИСТИНА);
	// -- Мохов 20.02.2026 ПРЗ.17
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
